FKDD_COPY_DIFF_3_2026-02-13/Catalogs/Должности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Должности</Name>
			<Comment>Должности сотрудников</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Псевдоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорийнаяДолжность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Авторабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/Должности/Ext/ManagerModule.bsl
// процедура заполнения предопределенных элементов
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	
	//Заполним предопределенными работами 
	Объект = Справочники.Должности.Диспетчер.ПолучитьОбъект();
	Если Объект.Работы.Количество()=0 Тогда
		НоваяСтрока = Объект.Работы.Добавить();
		НоваяСтрока.Авторабота = Справочники.Автоработы.Приемка;
		НоваяСтрока = Объект.Работы.Добавить();
		НоваяСтрока.Авторабота = Справочники.Автоработы.Выдача;
		Попытка
			Объект.Записать();
		Исключение
			Сообщить("Ошибка обновления должности <"+Объект+">: "+ОписаниеОшибки());
		КонецПопытки; 
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
